{
  "base_tests": [
    {
      "test_base.py::test_html_file_present": [
        "O arquivo HTML está presente. Bom trabalho!",
        "O arquivo HTML está ausente. Por favor, verifique se você incluiu o arquivo HTML correto."
      ]
    },
    {
      "test_base.py::test_css_file_present": [
        "O arquivo CSS está presente. Excelente!",
        "O arquivo CSS está ausente. Certifique-se de que o arquivo CSS foi incluído corretamente e possui o nome `styles.css`."
      ]
    },
    {
      "test_base.py::test_div_usage": [
        "Você está utilizando a tag <div> corretamente. Excelente!",
        "A tag <div> está ausente ou mal utilizada. Verifique se está estruturando a página com as tags <div> conforme necessário."
      ]
    },
    {
      "test_base.py::test_ul_li_usage": [
        "Ótimo! Você está utilizando corretamente as tags <ul> e <li>.",
        "As tags <ul> e/ou <li> estão ausentes. Por favor, use-as para organizar listas em seu HTML."
      ]
    }
  ],
  "bonus_tests": [
    {
      "test_bonus.py::test_responsiveness": [
        "Seu design é responsivo! Ótimo trabalho com as media queries.",
        "Sua página não é responsiva. Adicione media queries para garantir que o design se adapte a diferentes tamanhos de tela."
      ]
    },
    {
      "test_bonus.py::test_creative_design": [
        "Excelente uso de elementos criativos! As animações e efeitos de hover estão bem executados.",
        "Faltam elementos criativos como animações ou efeitos de hover. Tente adicionar mais aprimoramentos visuais."
      ]
    }
  ],
  "penalty_tests": [
    {
      "test_penalty.py::test_table_tag_penalty": [
        "As tags de tabela foram encontradas, isso causa a reprovação instantânea. Lembre-se de utilizar apenas display Flex e Grid.",
        "Nenhuma tag de tabela foi encontrada, parabéns!"
      ]
    },
    {
      "test_penalty.py::test_improper_flex_usage": [
        "Flexbox não foi usado, ele é obrigatório para essa atividade.",
        "Flexbox está sendo usado, parabéns!"
      ]
    },
    {
      "test_penalty.py::test_improper_grid_usage": [
        "Grid não foi usado, ele é obrigatório para essa atividade.",
        "Grid está sendo usado, parabéns!"
      ]
    },
    {
      "test_penalty.py::test_missing_div_tags": [
        "O seu HTML não possui tags `div`, lembre-se de utilizá-las como containers para trabalhar com as tabelas.",
        "Você está fazendo uso das tags `div`, parabéns!"
      ]
    },
    {
      "test_penalty.py::test_missing_ul_tags": [
        "O seu HTML não possui tags `ul`, lembre-se de utilizá-las como containers para trabalhar com os conteúdos.",
        "Você está fazendo uso das tags `ul`, parabéns!"
      ]
    },
    {
      "test_penalty.py::test_missing_li_tags": [
        "O seu HTML não possui tags `li`, lembre-se de utilizá-las como containers para trabalhar com os conteúdos.",
        "Você está fazendo uso das tags `li`, parabéns!"
      ]
    },
    {
      "test_penalty.py::test_poor_structure": [
        "Nenhuma linha ou coluna foi encontrada, certifique-se de que sua página contenha uma tabela com múltiplas linhas e colunas.",
        "Linhas e colunas presentes na estrutura."
      ]
    }
  ]
}
